# Задача: ввести два числа: x и y.
# Напечатать сумму и произведение этих чисел (оператор + и *)
x = int(input('Введите число x: '))
y = int(input('Введите число y: '))
print('Сумма равна:', x+y, 'Произведение равно:', x*y)